01Hub/fbedit/STM32F4Discovery/STM32F4_LCMeter/STM32_LCMeter/main.c
/**
  ******************************************************************************
  * @file    LCMeter/main.c 
  * @author  KO
  * @version V1.0.0
  * @date    20-February-2014
  * @brief   Main program body
  ******************************************************************************
  */

/**
  ******************************************************************************
  Port pins
  PA.00           Frequency counter scope input (TIM5)
  PA.01           Frequency counter input (TIM2)
  PA.04           Scope V-Pos DAC1 Output
  PA.05           Scope trigger position  DAC2 Output
  PB.07           High Speed Clock
  PB.13           SPI SCK
  PB.15           SPI MOSI
  PC.01           Scope ADC
  PD.00           Frequency counter select0
  PD.01           Frequency counter select1
  PD.02           Frequency counter select2
  PD.06           LCMeter L/C selection, C = Low L = High
  PD.07           LCMeter calibration
  PD.08           USART3 TX
  PD.09           USART3 RX
  PE.03			      Scope X10 Output OD
  PE.04			      Scope X5 Output OD
  PE.05			      Scope X10 Output OD
  PE.08 to PE.15  LGA Inputs
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  uint32_t HSCSet;
  uint32_t HSCDiv;
} STM32_HSCTypeDef;

typedef struct
{
  uint32_t Frequency;
  uint32_t FrequencySCP;
} STM32_FRQTypeDef;

typedef struct
{
  uint32_t FrequencyCal0;
  uint32_t FrequencyCal1;
} STM32_LCMTypeDef;

typedef struct
{
  uint32_t ADC_Prescaler;
  uint32_t ADC_TwoSamplingDelay;
  uint32_t ScopeTrigger;
  uint32_t ScopeTriggerLevel;
  uint32_t ScopeTimeDiv;
  uint16_t ScopeVoltDiv;
  uint16_t ScopeMag;
  uint32_t ScopeVPos;
  uint32_t ADC_TripleMode;
  uint32_t ADC_SampleTime;
  uint32_t ADC_SampleSize;
  uint32_t SubSampling;
} STM32_SCPTypeDef;

typedef struct
{
  uint8_t SampleRateSet;
  uint8_t PixDiv;
  uint8_t nDiv;
  uint8_t Mag;
  uint8_t SubSampling;
  uint8_t Trigger;
  uint16_t TriggerLevel;
  uint16_t VPos;
  uint16_t Triple;
  uint32_t TimeDiv;
  uint32_t SampleRate;
} STM32_SCP2TypeDef;

typedef struct
{
  uint16_t DDS_Cmd;
  uint16_t DDS_Wave;
  uint32_t DDS__PhaseAdd;
  uint32_t DDS_Amplitude;
  uint32_t DDS_DCOffset;
	uint16_t SWEEP_Mode;
	uint16_t SWEEP_Time;
	uint32_t SWEEP_Step;
	uint32_t SWEEP_Min;
	uint32_t SWEEP_Max;
} STM32_DDSTypeDef;

typedef struct
{
  uint8_t DataBlocks;
  uint8_t TriggerValue;
  uint8_t TriggerMask;
  uint8_t TriggerWait;
  uint16_t LGASampleRateDiv;
  uint16_t LGASampleRate;
} STM32_LGATypeDef;


typedef struct
{
  uint32_t Cmd;
  STM32_HSCTypeDef STM32_HSC;
  STM32_FRQTypeDef STM32_FRQ;
  STM32_LCMTypeDef STM32_LCM;
  STM32_SCPTypeDef STM32_SCP;
  STM32_DDSTypeDef STM32_DDS;
  STM32_LGATypeDef STM32_LGA;
  STM32_SCP2TypeDef STM32_SCP2;
  uint32_t TickCount;
  uint32_t PreviousCountTIM2;
  uint32_t ThisCountTIM2;
  uint32_t PreviousCountTIM5;
  uint32_t ThisCountTIM5;
  char BTBuff[64];
} STM32_CMDTypeDef;

/* Private define ------------------------------------------------------------*/
/* DDS WaveType */
#define CMD_DONE                                ((uint8_t)0)
#define CMD_LCMCAL                              ((uint8_t)1)
#define CMD_LCMCAP                              ((uint8_t)2)
#define CMD_LCMIND                              ((uint8_t)3)
#define CMD_FRQCH1                              ((uint8_t)4)
#define CMD_FRQCH2                              ((uint8_t)5)
#define CMD_FRQCH3                              ((uint8_t)6)
#define CMD_SCPSET                              ((uint8_t)7)
#define CMD_HSCSET                              ((uint8_t)8)
#define CMD_DDSSET                              ((uint8_t)9)
#define CMD_LGASET                              ((uint8_t)10)
#define CMD_WAVEUPLOAD                          ((uint8_t)11)
#define CMD_SCP2SET                             ((uint8_t)12)

#define DDS_PHASESET                            ((uint8_t)1)
#define DDS_WAVESET                             ((uint8_t)2)
#define DDS_SWEEPSET                            ((uint8_t)3)
#define DDS_WAVEUPLOAD                          ((uint8_t)4)

#define SWEEP_ModeOff                           ((uint8_t)0)
#define SWEEP_ModeUp                            ((uint8_t)1)
#define SWEEP_ModeDown                          ((uint8_t)2)
#define SWEEP_ModeUpDown                        ((uint8_t)3)

#define ADC_CDR_ADDRESS                         ((uint32_t)0x40012308)
#define PE_IDR_Address                          ((uint32_t)0x40021011)
#define SCOPE_DATAPTR                           ((uint32_t)0x20008000)
#define SCOPE_DATASIZE                          ((uint32_t)0x10000)
#define LGA_DATAPTR                             ((uint32_t)0x20008000)
#define WAVE_DATAPTR                            ((uint32_t)0x20008000)
#define STM32_CLOCK                             ((uint32_t)200000000)
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
__IO STM32_CMDTypeDef STM32_CMD;                // 0x20000014

/* Private function prototypes -----------------------------------------------*/
void RCC_Config(void);
void NVIC_Config(void);
void GPIO_Config(void);
void TIM_Config(void);
void DAC_Config(void);
void DMA_SingleConfig(uint32_t SampleSize);
void ADC_SingleConfig(uint32_t Prescaler, uint32_t SampleTime);
void DMA_TripleConfig(uint32_t SampleSize);
void ADC_TripleConfig(uint32_t Prescaler, uint32_t TwoSamplingDelay);
void SPI_Config(void);
void USART_Config(uint32_t Baud);
void ScopeSubSampling(void);
uint32_t GetFrequency(void);
void LCM_Calibrate(void);
void SPISendData32(uint32_t tx);
void SPISendData(uint16_t tx);
void USART3_putdata(uint8_t *dat,uint16_t len);
void USART3_puts(char *str);
void USART3_getdata(uint8_t *dat,uint16_t len);
void DMA_LGAConfig(void);
void SendCompressedBuffer(uint32_t *in,uint16_t len);

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void) {
  __IO uint16_t i;
  __IO uint16_t *ptr;
  __IO uint16_t tmp1;
  __IO uint16_t tmp2;
  uint32_t scpcnt;
  uint32_t scpwait;

  /* RCC Configuration */
  RCC_Config();
  /* GPIO Configuration */
  GPIO_Config();
  /* TIM Configuration */
  TIM_Config();
  /* NVIC Configuration */
  NVIC_Config();
  /* DAC Configuration */
  DAC_Config();
  /* SPI Configuration */
  SPI_Config();
  /* USART Configuration */
  USART_Config(115200);
  /* Calibrate LC Meter */
  LCM_Calibrate();

  // /* Update baudrate */
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount);
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount);
  // USART3_puts("AT\0");
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount)
  // {
    // if ((USART3->SR & USART_FLAG_RXNE) != 0)
    // {
      // STM32_CMD.BTBuff[i] = USART3->DR;
      // i++;
    // }
  // }
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount);
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount);
  // USART3_puts("AT+BAUD8\0");
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount)
  // {
    // if ((USART3->SR & USART_FLAG_RXNE) != 0)
    // {
      // STM32_CMD.BTBuff[i] = USART3->DR;
      // i++;
    // }
  // }
  // while (1)
  // {
  // }

  while (1) {
    USART3_getdata((uint8_t *)&STM32_CMD.Cmd,4);
    switch (STM32_CMD.Cmd)
    {
      case CMD_LCMCAL:
        LCM_Calibrate();
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_LCM.FrequencyCal0,sizeof(STM32_LCMTypeDef));
        break;
      case CMD_LCMCAP:
        GPIO_ResetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_LCM.FrequencyCal0,sizeof(STM32_LCMTypeDef));
        break;
      case CMD_LCMIND:
        GPIO_ResetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_6);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_LCM.FrequencyCal0,sizeof(STM32_LCMTypeDef));
        break;
      case CMD_FRQCH1:
        GPIO_ResetBits(GPIOD, GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_0);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        break;
      case CMD_FRQCH2:
        GPIO_ResetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_1);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        break;
      case CMD_FRQCH3:
        GPIO_ResetBits(GPIOD, GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_1);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        break;
      case CMD_SCPSET:
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        USART3_getdata((uint8_t *)&STM32_CMD.STM32_SCP.ADC_Prescaler,sizeof(STM32_SCPTypeDef));
        /* Scope magnify */
        i = (STM32_CMD.STM32_SCP.ScopeMag & 0x07) << 3;
        GPIO_SetBits(GPIOE,(i ^ 0x38));
        GPIO_ResetBits(GPIOE,i);
        /* Set V-Pos */
        DAC_SetChannel1Data(DAC_Align_12b_R, STM32_CMD.STM32_SCP.ScopeVPos);
        /* Set Trigger level */
        DAC_SetChannel2Data(DAC_Align_12b_R, STM32_CMD.STM32_SCP.ScopeTriggerLevel);
        if (STM32_CMD.STM32_SCP.ADC_TripleMode) {
          /* DMA Configuration */
          DMA_TripleConfig(STM32_CMD.STM32_SCP.ADC_SampleSize);
          /* ADC Configuration */
          ADC_TripleConfig(STM32_CMD.STM32_SCP.ADC_Prescaler, STM32_CMD.STM32_SCP.ADC_TwoSamplingDelay);
        } else {
          /* DMA Configuration */
          DMA_SingleConfig(STM32_CMD.STM32_SCP.ADC_SampleSize);
          /* ADC Configuration */
          ADC_SingleConfig(STM32_CMD.STM32_SCP.ADC_Prescaler,STM32_CMD.STM32_SCP.ADC_SampleTime);
        }
        if (STM32_CMD.STM32_SCP.ScopeTrigger == 2) {
          /* Rising edge */
          TIM5->CCER &= ~0x2;
        } else {
          /* Falling edge */
          TIM5->CCER |= 0x2;
        }
        if (STM32_CMD.STM32_SCP.ScopeTrigger) {
          /* Wait for trigger */
          scpcnt = TIM5->CNT;
          scpwait = STM32_CMD.TickCount + 2;
          while (scpcnt == TIM5->CNT && scpwait != STM32_CMD.TickCount);
        }
        /* Start ADC1 Software Conversion */
        ADC1->CR2 |= (uint32_t)ADC_CR2_SWSTART;
        i = 0;
        while (i < 30000) {
          i++;
        }
        /* Since BlueTooth is slower than the lowest sampling rate there is no need to wait */
        SendCompressedBuffer((uint32_t *)SCOPE_DATAPTR, STM32_CMD.STM32_SCP.ADC_SampleSize / 4);
        /* Done */
        ADC->CCR=0;
        ADC1->CR2=0;
        ADC2->CR2=0;
        ADC3->CR2=0;
        break;
      case CMD_SCP2SET:
        STM_EVAL_LEDToggle(LED4);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        USART3_getdata((uint8_t *)&STM32_CMD.STM32_SCP2.SampleRateSet,sizeof(STM32_SCP2TypeDef));
        /* Scope magnify */
        i = ((uint32_t)STM32_CMD.STM32_SCP2.Mag & 0x07) << 3;
        GPIO_SetBits(GPIOE,(i ^ 0x38));
        GPIO_ResetBits(GPIOE,i);
        /* Set V-Pos */
        DAC_SetChannel1Data(DAC_Align_12b_R, STM32_CMD.STM32_SCP2.VPos);
        /* Set Trigger level */
        DAC_SetChannel2Data(DAC_Align_12b_R, STM32_CMD.STM32_SCP2.TriggerLevel);
        if (STM32_CMD.STM32_SCP2.Triple) {
          /* DMA Configuration */
          DMA_TripleConfig(32768);
          /* ADC Configuration */
          ADC_TripleConfig((uint32_t)STM32_CMD.STM32_SCP2.SampleRateSet >> 4,(uint32_t)STM32_CMD.STM32_SCP2.SampleRateSet & 0xF);
        } else {
          /* DMA Configuration */
          DMA_SingleConfig(32768);
          /* ADC Configuration */
          ADC_SingleConfig(((uint32_t)STM32_CMD.STM32_SCP2.SampleRateSet >> 3) & 0x3,(uint32_t)STM32_CMD.STM32_SCP2.SampleRateSet & 0x7);
        }
        if (STM32_CMD.STM32_SCP2.Trigger == 2) {
          /* Rising edge */
          TIM5->CCER &= ~0x2;
        } else {
          /* Falling edge */
          TIM5->CCER |= 0x2;
        }
        if (STM32_CMD.STM32_SCP2.Trigger) {
          /* Wait for trigger */
          scpcnt = TIM5->CNT;
          scpwait = STM32_CMD.TickCount + 2;
          while (scpcnt == TIM5->CNT && scpwait != STM32_CMD.TickCount);
        }
        /* Start ADC1 Software Conversion */
        ADC1->CR2 |= (uint32_t)ADC_CR2_SWSTART;
        /* Wait until DMA transfer complete */
        while (DMA_GetFlagStatus(DMA2_Stream0, DMA_FLAG_TCIF0) == RESET);
        SendCompressedBuffer((uint32_t *)SCOPE_DATAPTR, (uint32_t)STM32_CMD.STM32_SCP2.PixDiv * (uint32_t)STM32_CMD.STM32_SCP2.nDiv * 2 / 4);
        /* Done */
        ADC->CCR=0;
        ADC1->CR2=0;
        ADC2->CR2=0;
        ADC3->CR2=0;
        STM_EVAL_LEDToggle(LED4);
        break;
      case CMD_HSCSET:
        GPIO_ResetBits(GPIOD, GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_0);
        USART3_getdata((uint8_t *)&STM32_CMD.STM32_HSC.HSCSet,sizeof(STM32_HSCTypeDef));
        TIM4->ARR = STM32_CMD.STM32_HSC.HSCSet;
        TIM4->CCR2 = (STM32_CMD.STM32_HSC.HSCSet+1) / 2;
        TIM4->PSC = STM32_CMD.STM32_HSC.HSCDiv;
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        break;
      case CMD_DDSSET:
        USART3_getdata((uint8_t *)&STM32_CMD.STM32_DDS.DDS_Cmd,sizeof(STM32_DDSTypeDef));
        if (STM32_CMD.STM32_DDS.DDS_Cmd == DDS_PHASESET) {
          SPISendData(DDS_PHASESET);
          SPISendData32(STM32_CMD.STM32_DDS.DDS__PhaseAdd);
        }
        else if (STM32_CMD.STM32_DDS.DDS_Cmd == DDS_WAVESET) {
          SPISendData(DDS_WAVESET);
          SPISendData(STM32_CMD.STM32_DDS.DDS_Wave);
          SPISendData(STM32_CMD.STM32_DDS.DDS_Amplitude);
          SPISendData(STM32_CMD.STM32_DDS.DDS_DCOffset);
        } else if (STM32_CMD.STM32_DDS.DDS_Cmd == DDS_SWEEPSET) {
          SPISendData(DDS_SWEEPSET);
          SPISendData(STM32_CMD.STM32_DDS.SWEEP_Mode);
          SPISendData(STM32_CMD.STM32_DDS.SWEEP_Time);
          SPISendData32(STM32_CMD.STM32_DDS.SWEEP_Step);
          SPISendData32(STM32_CMD.STM32_DDS.SWEEP_Min);
          SPISendData32(STM32_CMD.STM32_DDS.SWEEP_Max);
        }
        break;
      case CMD_LGASET:
        USART3_getdata((uint8_t *)&STM32_CMD.STM32_LGA.DataBlocks,sizeof(STM32_LGATypeDef));
        /* Set the Prescaler value */
        TIM8->PSC = STM32_CMD.STM32_LGA.LGASampleRateDiv;
        /* Set the Autoreload value */
        TIM8->ARR = STM32_CMD.STM32_LGA.LGASampleRate;
        TIM8->CNT =  STM32_CMD.STM32_LGA.LGASampleRate-1;
        DMA_LGAConfig();
        TIM_DMACmd(TIM8, TIM_DMA_Update, ENABLE);
        /* DMA2_Stream1 enable */
        DMA_Cmd(DMA2_Stream1, ENABLE);
        /* Enable timer */
        TIM8->CR1 |= TIM_CR1_CEN;
        while (DMA_GetFlagStatus(DMA2_Stream1,DMA_FLAG_HTIF1) == RESET);
        /* Half done */
        USART3_putdata((uint8_t *)LGA_DATAPTR, STM32_CMD.STM32_LGA.DataBlocks * 1024 / 2);
        while (DMA_GetFlagStatus(DMA2_Stream1,DMA_FLAG_TCIF1) == RESET);
        /* Done */
        USART3_putdata((uint8_t *)(LGA_DATAPTR + STM32_CMD.STM32_LGA.DataBlocks * 1024 / 2), STM32_CMD.STM32_LGA.DataBlocks * 1024 / 2);
        TIM_Cmd(TIM8, DISABLE);
        DMA_DeInit(DMA2_Stream1);
        break;
      case CMD_WAVEUPLOAD:
        USART3_getdata((uint8_t *)WAVE_DATAPTR,4096);
        SPISendData(DDS_WAVEUPLOAD);
        ptr = (uint16_t *)WAVE_DATAPTR;
        i = 2048;
        while (i--) {
          SPISendData(*ptr);
          ptr++;
        }
        STM_EVAL_LEDToggle(LED4);
        break;
    }
  }
}

/**
  * @brief  ADC data is 12 bits so 2 halfwords (4 bytes) is compressed into 3 bytes.
  * @param  Pointer to buffer, buffer size
  * @retval None
  */
void SendCompressedBuffer(uint32_t *in,uint16_t len) {
  __IO uint32_t dat32;
  __IO uint8_t dat8;
  while  (len--)
  {
    dat32 = *in;
    dat32 = ((dat32 >> 4) & 0x00fff000) | (dat32 & 0xfff);

    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);
    /* Transmit Data */
    dat8 = dat32;
    USART3->DR = (uint16_t)dat8;

    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);
    /* Transmit Data */
    dat8 = dat32 >> 8;
    USART3->DR = (uint16_t)dat8;

    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);
    /* Transmit Data */
    dat8 = dat32 >> 16;
    USART3->DR = (uint16_t)dat8;

    *in++;
  }
}

/**
  * @brief  Get frequency reading.
  * @param  None
  * @retval None
  */
uint32_t GetFrequency(void) {
  uint32_t i;
  i = STM32_CMD.TickCount;
  while (i == STM32_CMD.TickCount);
  return STM32_CMD.STM32_FRQ.Frequency;
}

/**
  * @brief  Calibrate LC Meter.
  * @param  None
  * @retval None
  */
void LCM_Calibrate(void) {
  uint32_t i;
  GPIO_ResetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
  STM32_CMD.STM32_LCM.FrequencyCal0 = 0;
  STM32_CMD.STM32_LCM.FrequencyCal1 = 0;
  i = GetFrequency();
  i = 0;
  while (i < 4) {
    STM32_CMD.STM32_LCM.FrequencyCal0 += GetFrequency();
    i++;
  }
  STM32_CMD.STM32_LCM.FrequencyCal0 /= 4;
  GPIO_SetBits(GPIOD, GPIO_Pin_7);
  i = GetFrequency();
  i = 0;
  while (i < 4) {
    STM32_CMD.STM32_LCM.FrequencyCal1 += GetFrequency();
    i++;
  }
  STM32_CMD.STM32_LCM.FrequencyCal1 /= 4;
  GPIO_ResetBits(GPIOD, GPIO_Pin_7);
}

/**
  * @brief  SPI Send 32 bit data.
  * @param  tx
  * @retval None
  */
void SPISendData32(uint32_t tx) {
  SPISendData(tx);
  SPISendData(tx >> 16);
}

/**
  * @brief  SPI Send 16 bit data.
  * @param  tx
  * @retval None
  */
void SPISendData(uint16_t tx) {
	SPI2->DR = tx;                            // write data to be transmitted to the SPI data register
	while (!(SPI2->SR & SPI_I2S_FLAG_TXE));   // wait until transmit complete
  while (SPI2->SR & SPI_I2S_FLAG_BSY);      // wait until SPI is not busy anymore
}

/**
  * @brief  USART3 send byte array.
  * @param  pointer to array, lenght
  * @retval None
  */
void USART3_putdata(uint8_t *dat,uint16_t len) {
  /* Data are transmitted one byte at a time. */
  while (len--) {
    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);          
    /* Transmit Data */
    USART3->DR = (uint16_t)*dat;
    *dat++;
  }
}

/**
  * @brief  USART3 send string.
  * @param  Zero terminated string
  * @retval None
  */
void USART3_puts(char *str) {
  char c;
  /* Characters are transmitted one at a time. */
  while ((c = *str++)) {
    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);
    /* Transmit Data */
    USART3->DR = (uint16_t)c;
  }
}

/**
  * @brief  USART3 receives byte array.
  * @param  pointer to array, lenght
  * @retval None
  */
void USART3_getdata(uint8_t *dat,uint16_t len) {
  /* Data are recieved one byte at a time. */
  while (len--) {
    /* Wait until receive register not empty */
    while((USART3->SR & USART_FLAG_RXNE) == 0);          
    /* Receive Data */
    *dat = (uint8_t)USART3->DR;
    *dat++;
  }
  // STM_EVAL_LEDToggle(LED4);
}

/**
  * @brief  Configure the RCC.
  * @param  None
  * @retval None
  */
void RCC_Config(void) {
  /* SPI2, DAC, TIM2, TIM3, TIM4 and TIM5 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2 | RCC_APB1Periph_DAC | RCC_APB1Periph_TIM2 | RCC_APB1Periph_TIM3 | RCC_APB1Periph_TIM4 | RCC_APB1Periph_TIM5, ENABLE);
  /* DMA2 clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
  /* GPIOA clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
  /* GPIOB clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
  /* GPIOC clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
  /* GPIOD clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
  /* GPIOE clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
  /* USART3 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE); 
  /* Enable TIM8, ADC1, ADC2 and ADC3 clocks */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8 | RCC_APB2Periph_ADC1 | RCC_APB2Periph_ADC2 | RCC_APB2Periph_ADC3, ENABLE);
}

/**
  * @brief  Configure the NVIC.
  * @param  None
  * @retval None
  */
void NVIC_Config(void) {
  NVIC_InitTypeDef NVIC_InitStructure;
  /* Enable the TIM3 gloabal Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

/**
  * @brief  Configure the GPIO.
  * @param  None
  * @retval None
  */
void GPIO_Config(void) {
  GPIO_InitTypeDef GPIO_InitStructure;
  /* Initialize Leds mounted on STM32F4-Discovery board */
  STM_EVAL_LEDInit(LED3);
  STM_EVAL_LEDInit(LED4);

  /* TIM2 chennel2 configuration : PA.01 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  /* Connect TIM2 pin to AF2 */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_TIM2);

  /* TIM5 chennel1 configuration : PA.00 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  /* Connect TIM5 pin to AF2 */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF_TIM5);

  /* TIM4 chennel 2 configuration : PB7 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP ;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  /* Connect TIM4 pin to AF2 */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_TIM4);

  /* Configure ADC123 Channel 11 pin as analog input (Scope) */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

